Update design.md 2.1
